package com.zizi.rendezvous;

class Data {

    //константы
    public static final String ANY_PLACE = "Любое место";
    public static final String anyTime = "Любое время";
    public static final String channelID = "Сообщения";
    public static final String tagLog = "!@#";
    public static final String ACTIVITY_LOGIN = "ActivityLogin";
    public static final String FRAGMENT_CHAT = "FragmentChat";
    public static final String ACTIVE = "Active";
    public static final String NOT_ACTIVE = "NotActive";
    public static final String OTHER = "Прочее";


    public static final String[] regionsTmp = new String[]{
        "Нижегородская область",
        "Республика Мордовия"
    };

    public static final String[] regions = new String[]{
        "Алтайский край",
        "Амурская область",
        "Архангельская область",
        "Астраханская область",
        "Белгородская область",
        "Брянская область",
        "Владимирская область",
        "Волгоградская область",
        "Вологодская область",
        "Воронежская область",
        "г. Москва",
        "Еврейская автономная область",
        "Забайкальский край",
        "Ивановская область",
        "Иркутская область",
        "Кабардино-Балкарская Республика",
        "Калининградская область",
        "Калужская область",
        "Камчатский край",
        "Карачаево-Черкесская Республика",
        "Кемеровская область",
        "Кировская область",
        "Костромская область",
        "Краснодарский край",
        "Красноярский край",
        "Курганская область",
        "Курская область",
        "Ленинградская область",
        "Липецкая область",
        "Магаданская область",
        "Московская область",
        "Мурманская область",
        "Ненецкий автономный округ",
        "Нижегородская область",
        "Новгородская область",
        "Новосибирская область",
        "Омская область",
        "Оренбургская область",
        "Орловская область",
        "Пензенская область",
        "Пермский край",
        "Приморский край",
        "Псковская область",
        "Республика Адыгея",
        "Республика Алтай",
        "Республика Башкортостан",
        "Республика Бурятия",
        "Республика Дагестан",
        "Республика Ингушетия",
        "Республика Калмыкия",
        "Республика Карелия",
        "Республика Коми",
        "Республика Крым",
        "Республика Марий Эл",
        "Республика Мордовия",
        "Республика Саха (Якутия)",
        "Республика Северная Осетия - Алания",
        "Республика Татарстан",
        "Республика Тыва",
        "Республика Хакасия",
        "Ростовская область",
        "Рязанская область",
        "Самарская область",
        "Санкт-Петербург",
        "Саратовская область",
        "Сахалинская область",
        "Свердловская область",
        "Севастополь",
        "Смоленская область",
        "Ставропольский край",
        "Тамбовская область",
        "Тверская область",
        "Томская область",
        "Тульская область",
        "Тюменская область",
        "Удмуртская Республика",
        "Ульяновская область",
        "Хабаровский край",
        "Ханты-Мансийский автономный округ - Югра",
        "Челябинская область",
        "Чеченская Республика",
        "Чувашская Республика - Чувашия",
        "Чукотский автономный округ",
        "Ямало-Ненецкий автономный округ",
        "Ярославская область"


    };

    public static final String[] theRepublicOfMordovia = new String[]{
        "Ардатов",
        "Инсар",
        "Ковылкино",
        "Краснослободск",
        "Рузаевка",
        "Саранск",
        "Темников"

    };

    public static final String[] nizhnyNovgorodRegion = new String[]{
        "Арзамас",
        "Балахна",
        "Богородск",
        "Бор",
        "Ветлуга",
        "Володарск",
        "Ворсма",
        "Выкса",
        "Горбатов",
        "Городец",
        "Дзержинск",
        "Заволжье",
        "Княгинино",
        "Кстово",
        "Кулебаки",
        "Лукоянов",
        "Лысково",
        "Навашино",
        "Нижний Новгород",
        "Павлово",
        "Первомайск",
        "Перевоз",
        "Саров",
        "Семенов",
        "Сергач",
        "Урень",
        "Чкаловск",
        "Шахунья"
    };

    public static final String[] times = new String[]{
        //"Любое время",
        anyTime,
        "Сейчас",
        "00:00",
        "01:00",
        "02:00",
        "03:00",
        "04:00",
        "05:00",
        "06:00",
        "07:00",
        "08:00",
        "09:00",
        "10:00",
        "11:00",
        "12:00",
        "13:00",
        "14:00",
        "15:00",
        "16:00",
        "17:00",
        "18:00",
        "19:00",
        "20:00",
        "21:00",
        "22:00",
        "23:00"
    };

}
